shockTube/constant/chemicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      chemicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Q       50;     // specific heat release [J/kg]
// E       25;     // activation energy [J/kg]
//  E       26;     // activation energy [J/kg]
// k       35.956; // rate constant [1/s]
// k       35.955584760859722; // rate constant [1/s]
Q		0.;
E 		25;
k		1.;
T0		0.;

// ************************************************************************* //
